<?php
session_start(); // Запуск сессии для авторизации

//--============================================Основной путь============================================--
define("PATH", "http://avtorization/");

//--============================================Путь до стилей CSS============================================--
define("CSS", PATH."pages/css/");

//--============================================Путь до скриптов JS============================================--
define("JS", PATH."pages/js/");

//--============================================Название сайта============================================--
define("TITLE", "Драйвер");

//--============================================Путь до изображений============================================--
define("IMG", PATH."pages/img/");

//--============================================Путь до файлов============================================--
define("FILES", PATH."pages/files/");

//--============================================Путь до галереи============================================--
define("GALLERY", PATH."pages/files/gallery/");

//--============================================Путь до стилей Bootstrap'a============================================--
define("BOOTSTRAP", PATH."pages/bootstrap/");

//--============================================Путь для шрифтов============================================--
define("FONTS", PATH."pages/fonts/");

//--============================================Основной хост, подключение к БД============================================--
define("HOST", "localhost");

//--============================================Пользователь для подключения к БД============================================--
define("USER_BD", "root");

//--============================================Пароль пользователя в БД============================================--
define("PASS_BD", "");

//--============================================Название базы данных============================================--
define("BASE_BD", "main_users");


//--============================================Подключение к БД============================================--
$mysqli = new mysqli(HOST, USER_BD, PASS_BD, BASE_BD);
    if($mysqli -> connect_errno){
        echo "При подключении БД произошла ошибка: ".$mysqli -> connect_error;
        exit();
    }
?>